; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	infrared2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star9 - direction
	Star8 - direction
	Star2 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star9)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument2 spectrograph3)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
)
(:goal (and
	(have_image Phenomenon10 infrared2)
	(have_image Phenomenon11 spectrograph0)
	(have_image Planet12 spectrograph4)
	(have_image Planet13 spectrograph4)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 infrared2)
	(have_image Star16 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star2 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star2)
   goals met: 0 of 7
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite2 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite2 phenomenon10 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon10)
   goals met: 0 of 7
5. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 0 of 7
6. (take_image satellite2 phenomenon10 instrument2 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 1 of 7
7. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
8. (calibrate satellite1 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 1 of 7
9. (turn_to satellite1 phenomenon11 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 7
10. (take_image satellite1 phenomenon11 instrument1 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 2 of 7
11. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 2 of 7
12. (take_image satellite1 planet12 instrument1 spectrograph4)
   added: (have_image planet12 spectrograph4)
   goals met: 3 of 7
13. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 3 of 7
14. (take_image satellite1 planet13 instrument1 spectrograph4)
   added: (have_image planet13 spectrograph4)
   goals met: 4 of 7
15. (turn_to satellite1 star16 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star16)
   goals met: 4 of 7
16. (take_image satellite1 star16 instrument1 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 5 of 7
17. (turn_to satellite2 phenomenon14 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon14)
   goals met: 5 of 7
18. (take_image satellite2 phenomenon14 instrument2 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 6 of 7
19. (turn_to satellite2 phenomenon15 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon15)
   goals met: 6 of 7
20. (take_image satellite2 phenomenon15 instrument2 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 7 of 7
